app/controllers/battings_controller.rb

	def show
		@batting = Batting.where(playerID: params[:playerID], yearID: params[:yearID])[0]
---
SELECT `Batting`.* FROM `Batting` WHERE `Batting`.`playerID` = 'ruthba01' AND `Batting`.`yearID` = 1914