app/controllers/masters_controller.rb

	def show

		@master = Master.find(params[:playerID])

		battings = @master.battings
		pitchings = @master.pitchings

		playerID = params[:playerID]

		#the key/value pairs set right here are for column titles that need different names in the view vs. their names in the database
		@batting_stat_columns = {
			"yearID" => "Year",
			"teamID" => "Team",
			"lgID" => "Lg."
		}

		#set key/value pairs for the rest of the column titles (exclude the columns that were already given titles and some unwanted columns)
		battings.column_names.each do |c|
			if !@batting_stat_columns.keys.include?(c) && !["playerID", "stint", "G_batting", "G_old"].include?(c)
---
SELECT `Master`.* FROM `Master` WHERE `Master`.`playerID` = 'williac01' LIMIT 1
SELECT `Batting`.* FROM `Batting` WHERE `Batting`.`master_id` = 'willidi02'
SELECT `Batting`.* FROM `Batting` WHERE `Batting`.`playerID` = 'willibo01'

	def letterlinks
		@letter = params[:letter].upcase
		@masters = Master.where("nameLast LIKE (?)", "#{params[:letter]}%").order(:nameLast)
---
SELECT `Master`.* FROM `Master` WHERE (nameLast LIKE ('G%')) ORDER BY `Master`.`nameLast` ASC

	def letterlist
		respond_to do |format|
			#format.text {render :text => params[:letter]}
			list_out = Master.where("nameLast LIKE (?)", "#{params[:letter]}%").collect{|m| [m.nameFirst, m.nameLast, m.playerID]}
---
SELECT `Master`.* FROM `Master` WHERE (nameLast LIKE ('a%'))