app/controllers/pitchings_controller.rb

	def show
		@pitching = Pitching.where(playerID: params[:playerID], yearID: params[:yearID])[0]
---
SELECT `Pitching`.* FROM `Pitching` WHERE `Pitching`.`playerID` = 'baekch01' AND `Pitching`.`yearID` = 2006